In [1]:
from pyspark import SparkContext,SparkConf
from pyspark.sql import SparkSession

try:
    sc.stop()
except:
    pass
spark = SparkSession \
    .builder.enableHiveSupport() \
    .appName("Python Spark SQL basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()
    
    
df = spark.read.json("/Users/tq/bigdatatest/20170201.log")

df.createOrReplaceTempView('RawTable')
preparetable = 'RawTable'

In [5]:
result1 = spark.sql(u'''
SELECT
    *
FROM %s
WHERE accountid is not null
AND type_name!="CorpLevelChg"
''' % preparetable).cache().createOrReplaceTempView('jsonTable')

#读取createProfile
uidlogNoChannel_df = spark.sql(u'''
        SELECT
            t.uid AS uid,
            SUBSTRING(t.lt,0,10) AS lt,
            CAST(CAST(jsonTable.utc8 as DATE) as varchar(10)) AS date,
            jsonTable.sid AS sid,
            jsonTable.gid AS gid
        FROM (
            SELECT
                userid AS uid,
                min(logtime) AS lt
            FROM jsonTable
            WHERE type_name="CreateProfile"
            GROUP BY userid
        ) t
        LEFT JOIN jsonTable ON jsonTable.userid = t.uid AND jsonTable.logtime = t.lt
    ''')

In [6]:
uidlogNoChannel_df.show()

+--------------------+----------+----------+----+---+
|                 uid|        lt|      date| sid|gid|
+--------------------+----------+----------+----+---+
|814e57be-71cf-4f1...|1485948309|2017-02-01|1001|200|
|51bd0109-10ad-440...|1485958162|2017-02-01|1001|200|
|0f6945ae-c903-43c...|1485962345|2017-02-01|1001|200|
|96ffeda7-0328-428...|1485932770|2017-02-01|1001|200|
|f2546ea0-6eaa-4cc...|1485932040|2017-02-01|1001|200|
|66d505e3-0c88-469...|1485937574|2017-02-01|1001|200|
|8bd1a0e0-15fa-43c...|1485946274|2017-02-01|1001|200|
|4a5d78af-09f3-47e...|1485955157|2017-02-01|1001|200|
|7c381892-111a-4fa...|1485953785|2017-02-01|1001|200|
|e8314b45-6bee-424...|1485936341|2017-02-01|1001|200|
|c807b6e9-ac3f-476...|1485950325|2017-02-01|1001|200|
|f9afa2ab-5df4-491...|1485922457|2017-02-01|1001|200|
|a7e7412d-864c-43a...|1485967515|2017-02-02|1001|200|
|4cd17aca-bde2-4f9...|1485912289|2017-02-01|1001|200|
|544f995f-60b4-414...|1485911244|2017-02-01|1001|200|
|e9fd2261-30d4-470...|1485973610|2017-02-02|1001|200|
|3374a0a3-8bf7-478...|1485940620|2017-02-01|1001|200|
|697b6f94-2f7a-4e2...|1485946542|2017-02-01|1001|200|
|3b18975a-6e7c-4d7...|1485945044|2017-02-01|1001|200|
|e2194898-ed24-4f4...|1485935952|2017-02-01|1001|200|
+--------------------+----------+----------+----+---+
only showing top 20 rows

In [3]:
paylog_df = spark.sql(u"""
SELECT *
FROM account_payTime
""")

In [4]:
paylog_df.toPandas()

,uid,acid,gid,sid,ch,corpLvl,vipLvl,payNum,payTime,LogTime,date
0,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200,1009,130134005400,88,15,9800,20170307092157,1488849770,2017-03-07
1,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200,1009,130134005400,88,15,100,20170307092237,1488849770,2017-03-07
2,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,200,1009,130134005400,88,15,100,20170307092252,1488849783,2017-03-07
3,d7566633-063f-4bde-bb49-9c29c6a5e168,200:1009:d7566633-063f-4bde-bb49-9c29c6a5e168,200,1009,130134005400,25,0,3000,20170307130531,1488863157,2017-03-07
4,2b5d190e-a67f-4c2c-a588-17ba6c468663,200:1009:2b5d190e-a67f-4c2c-a588-17ba6c468663,200,1009,130134001500,66,10,9800,20170307135722,1488866391,2017-03-07

In [5]:
fff = paylog_df.toPandas()

In [14]:
fff.to_json("/Users/tq/test444.json",orient='records')

In [15]:
df_temp_uid = spark.read.json("/Users/tq/test444.json")

In [16]:
df_temp_uid.toPandas()

,LogTime,acid,ch,corpLvl,date,gid,payNum,payTime,sid,uid,vipLvl
0,1488849770,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,130134005400,88,1488844800000,200,9800,20170307092157,1009,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,15
1,1488849770,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,130134005400,88,1488844800000,200,100,20170307092237,1009,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,15
2,1488849783,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,130134005400,88,1488844800000,200,100,20170307092252,1009,f6d38e9a-b775-4e65-8a9f-5b545ae41e67,15
3,1488863157,200:1009:d7566633-063f-4bde-bb49-9c29c6a5e168,130134005400,25,1488844800000,200,3000,20170307130531,1009,d7566633-063f-4bde-bb49-9c29c6a5e168,0
4,1488866391,200:1009:2b5d190e-a67f-4c2c-a588-17ba6c468663,130134001500,66,1488844800000,200,9800,20170307135722,1009,2b5d190e-a67f-4c2c-a588-17ba6c468663,10

In [17]:
df_temp_uid.show()

+----------+--------------------+------------+-------+-------------+---+------+--------------+----+--------------------+------+
|   LogTime|                acid|          ch|corpLvl|         date|gid|payNum|       payTime| sid|                 uid|vipLvl|
+----------+--------------------+------------+-------+-------------+---+------+--------------+----+--------------------+------+
|1488849770|200:1009:f6d38e9a...|130134005400|     88|1488844800000|200|  9800|20170307092157|1009|f6d38e9a-b775-4e6...|    15|
|1488849770|200:1009:f6d38e9a...|130134005400|     88|1488844800000|200|   100|20170307092237|1009|f6d38e9a-b775-4e6...|    15|
|1488849783|200:1009:f6d38e9a...|130134005400|     88|1488844800000|200|   100|20170307092252|1009|f6d38e9a-b775-4e6...|    15|
|1488863157|200:1009:d7566633...|130134005400|     25|1488844800000|200|  3000|20170307130531|1009|d7566633-063f-4bd...|     0|
|1488866391|200:1009:2b5d190e...|130134001500|     66|1488844800000|200|  9800|20170307135722|1009|2b5d190e-a67f-4c2...|    10|
+----------+--------------------+------------+-------+-------------+---+------+--------------+----+--------------------+------+

In [10]:
spark.sql(u"""
        SELECT
            t.acid AS acid,
            SUBSTRING(t.lt,0,10) AS lt,
            CAST(jsonTable.utc8 as DATE) AS date,
            jsonTable.sid AS sid,
            jsonTable.gid AS gid,
            jsonTable.channel AS ch,
            jsonTable.info.MachineType AS machine
        FROM (
            SELECT
                accountid AS acid,
                min(logtime) AS lt
            FROM jsonTable
            WHERE type_name="Login"
            GROUP BY accountid
        ) t
        LEFT JOIN jsonTable ON jsonTable.accountid = t.acid AND jsonTable.logtime = t.lt
        """).cache().createOrReplaceTempView('acid_ch')

In [11]:
uidlog_df = spark.sql(u"""
SELECT *
FROM acid_ch
""")

In [12]:
uidlog_df.toPandas()

,acid,lt,date,sid,gid,ch,machine
0,200:1009:134e6cae-8d09-4724-ae74-01e7341a90ea,1488867316,2017-03-07,1009,200,130134001300,vivo vivo X7
1,200:1009:d7566633-063f-4bde-bb49-9c29c6a5e168,1488884893,2017-03-07,1009,200,130134005400,Xiaomi MI MAX
2,200:1009:2b5d190e-a67f-4c2c-a588-17ba6c468663,1488858738,2017-03-07,1009,200,130134001500,samsung SM-A5000
3,200:1009:b4a072ac-f20e-4c06-96b9-6743fe224e80,1488869198,2017-03-07,1009,200,130134005400,Xiaomi MI NOTE LTE
4,200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67,1488880550,2017-03-07,1009,200,130134005400,Xiaomi MI PAD

In [14]:
payBySid = spark.sql(u'''
                SELECT
                    acid AS acid,
                    SUM(payNum) AS sumpay ,
                    sid AS sid
                FROM account_payTime
                GROUP BY sid,acid
                ''').cache().createOrReplaceTempView('payBySid')

In [19]:
ss = spark.sql(u'''
        SELECT
            *
        FROM payBySid
        ''').cache().createOrReplaceTempView('payByGidall')

In [18]:
ss.toPandas()

                                            acid  sumpay   sid
0  200:1009:d7566633-063f-4bde-bb49-9c29c6a5e168    3000  1009
1  200:1009:2b5d190e-a67f-4c2c-a588-17ba6c468663    9800  1009
2  200:1009:f6d38e9a-b775-4e65-8a9f-5b545ae41e67   10000  1009

In [29]:
payResultBySid = spark.sql(u'''
                        SELECT
                            s.sid As sid,
                            SUM(t.payNum) AS payNum,
                            COUNT(s.acid) AS people,
                            first(s.date) AS date
                        FROM(
                        (SELECT
                            acid AS acid,
                            date AS date,
                            sid AS sid
                        FROM acid_ch
                        WHERE date = "2017-03-07") s
                        LEFT OUTER JOIN(
                        SELECT
                            acid AS acid,
                            sumpay AS payNum,
                            sid AS sid
                        FROM payBySid
                        ) t
                        on t.acid = s.acid)
                        GROUP BY s.sid
                                ''')

In [33]:
ss = payResultBySid.toPandas()

In [31]:
x = payResultBySid.withColumn("days",payResultBySid.people-payResultByGid.people+1).toPandas()

NameError: name 'payResultByGid' is not defined

In [50]:
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String, create_engine,Float
from sqlalchemy.orm import scoped_session, sessionmaker

In [51]:
Base = declarative_base()
dbname='mysql+mysqlconnector://test1:QmPhaQ8hYsxx@54.223.192.252:3306/test'
engine = create_engine(dbname, echo=False)
DBSession = scoped_session(sessionmaker(bind=engine))

In [52]:
class LTVByGid(Base):
    __tablename__ = "ltv_byGid"
    id = Column(Integer, primary_key=True)
    gid = Column(String(255))
    creat_time = Column(String(255))
    people_count = Column(String(255))
    days = Column(String(255))
    consume = Column(Float,nullable=True)

In [59]:
def ltv_byGid_sqlalchemy_orm(df):
    # init_sqlalchemy()
    session = DBSession()
    x = []
    for dfdate in df.values:
        customer = LTVByGid()
        customer.gid = str(dfdate[0])
        customer.creat_time = str(dfdate[3])
        customer.people_count = str(dfdate[2])
        customer.days = str(dfdate[4])
        customer.consume = float(dfdate[1]) / float(dfdate[2]) / 100
        x.append(customer)
    session.add_all(x)
    session.commit()

In [60]:
ltv_byGid_sqlalchemy_orm(x)